hotRoom4A/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    wtwalls
    {
        type            wall;
        physicalType    wall;
        nFaces          3154;
        startFace       25967;
    }
    inlet
    {
        type            wall;
        physicalType    wall;
        nFaces          532;
        startFace       29121;
    }
    outlet
    {
        type            wall;
        physicalType    wall;
        nFaces          532;
        startFace       29653;
    }
    buildingFaces_master
    {
        type            wall;
        inGroups        2(wall buildingFaces);
        nFaces          130;
        startFace       30185;
    }
    buildingFaces_slave
    {
        type            wall;
        inGroups        2(wall buildingFaces);
        nFaces          130;
        startFace       30315;
    }
)

// ************************************************************************* //
